icuic/rl_petoi_stm32/firmware/stm32h747_disco/m7_inference_smoke/main.c
#include "rl_stedgeai_policy_v0.h"
#include "rl_serial_transport_v0.h"
#include "rl_uart8_transport_v0.h"
#include "petoi_official_gait_baseline_v0.h"

#include "stm32h747xx.h"

#include <math.h>

#define SMOKE_RL_GET_STATE_ATTEMPTS 10u
#define SMOKE_DEPLOY_STEP_COUNT 120u
#define SMOKE_DEPLOY_RAMP_STEPS 8u
#define SMOKE_DEPLOY_GAIT_FRAME_STRIDE 1u
#define SMOKE_DEPLOY_STATE_REFRESH_INTERVAL 5u
#define SMOKE_DELAY_INNER_ITERATIONS 20000u
#define SMOKE_DESKTOP_ASCII_UP_WARMUP 1u
#define SMOKE_DESKTOP_UP_COMMAND_COUNT 4u
#define SMOKE_DESKTOP_UP_COMMAND_DELAY_UNITS 250u
#define SMOKE_DESKTOP_UP_SETTLE_DELAY_UNITS 1200u
#define SMOKE_DESKTOP_DEPLOY_ATTITUDE_LIMIT 0.70f
#define SMOKE_DESKTOP_SAFETY_GRACE_STEPS 12u
#define SMOKE_DESKTOP_RL_RESIDUAL_SCALE 0.35f
#define SMOKE_ENABLE_UART8_TEXT_WARMUP 0u
#define SMOKE_UART8_TEXT_DIAGNOSTIC 0u
#define SMOKE_UART8_ASCII_QUERY_DIAGNOSTIC 0u
#define SMOKE_PI 3.14159265358979323846f

volatile float g_smoke_observation[RL_POLICY_V0_OBSERVATION_DIM];
volatile float g_smoke_expected_action[RL_POLICY_V0_ACTION_DIM];
volatile float g_smoke_action[RL_POLICY_V0_ACTION_DIM];
volatile float g_smoke_action_abs_diff[RL_POLICY_V0_ACTION_DIM];
volatile float g_smoke_action_max_abs_diff;
volatile int g_smoke_policy_ok;
volatile int g_smoke_policy_error;
volatile unsigned int g_uart8_probe_ok;
volatile unsigned int g_uart8_probe_tx_len;
volatile unsigned int g_uart8_probe_rx_len;
volatile unsigned int g_uart8_probe_timeout_count;
volatile unsigned int g_uart8_probe_overrun_count;
volatile unsigned char g_uart8_probe_rx[RL_UART8_V0_PROBE_RX_CAPACITY];
volatile unsigned int g_uart8_at_probe_count;
volatile unsigned int g_uart8_at_probe_ok[RL_UART8_V0_AT_PROBE_COUNT];
volatile unsigned int g_uart8_at_probe_command_len[RL_UART8_V0_AT_PROBE_COUNT];
volatile unsigned int g_uart8_at_probe_tx_len[RL_UART8_V0_AT_PROBE_COUNT];
volatile unsigned int g_uart8_at_probe_rx_len[RL_UART8_V0_AT_PROBE_COUNT];
volatile unsigned char g_uart8_at_probe_command[RL_UART8_V0_AT_PROBE_COUNT][RL_UART8_V0_PROBE_COMMAND_CAPACITY];
volatile unsigned char g_uart8_at_probe_rx[RL_UART8_V0_AT_PROBE_COUNT][RL_UART8_V0_PROBE_RX_CAPACITY];
volatile unsigned int g_uart8_safe_text_tx_count;
volatile unsigned int g_uart8_safe_text_tx_bytes;
volatile unsigned int g_uart8_drain_rx_bytes;
volatile unsigned char g_uart8_drain_rx[RL_UART8_V0_PROBE_RX_CAPACITY];
volatile unsigned int g_uart8_drain_round_count;
volatile unsigned int g_uart8_last_read_len;
volatile unsigned char g_uart8_last_read[RL_UART8_V0_PROBE_RX_CAPACITY];
volatile unsigned int g_uart8_rl_get_state_attempt_count;
volatile unsigned int g_uart8_rl_get_state_ok_count;
volatile unsigned int g_uart8_rl_attempt_transport_status[SMOKE_RL_GET_STATE_ATTEMPTS];
volatile unsigned int g_uart8_rl_attempt_protocol_status[SMOKE_RL_GET_STATE_ATTEMPTS];
volatile unsigned int g_uart8_rl_attempt_rx_bytes[SMOKE_RL_GET_STATE_ATTEMPTS];
volatile unsigned int g_uart8_rl_attempt_timeout_count[SMOKE_RL_GET_STATE_ATTEMPTS];
volatile unsigned int g_uart8_rl_attempt_overrun_count[SMOKE_RL_GET_STATE_ATTEMPTS];
volatile unsigned int g_uart8_rl_last_transport_status;
volatile unsigned int g_uart8_rl_last_protocol_status;
volatile unsigned int g_uart8_rl_last_rx_frame_len;
volatile unsigned int g_uart8_rl_transport_rx_bytes;
volatile unsigned int g_uart8_rl_transport_timeout_count;
volatile unsigned int g_uart8_rl_transport_overrun_count;
volatile unsigned char g_uart8_rl_last_rx_frame[RL_SERIAL_V0_MAX_FRAME_SIZE];
volatile float g_uart8_rl_last_roll;
volatile float g_uart8_rl_last_pitch;
volatile float g_uart8_rl_last_joint_feedback[RL_SERIAL_V0_TARGET_COUNT];
volatile unsigned int g_uart8_neutral_set_attempt_count;
volatile unsigned int g_uart8_neutral_set_ok_count;
volatile unsigned int g_uart8_neutral_set_transport_status;
volatile unsigned int g_uart8_neutral_set_protocol_status;
volatile unsigned int g_uart8_neutral_set_rx_frame_len;
volatile unsigned char g_uart8_neutral_set_rx_frame[RL_SERIAL_V0_MAX_FRAME_SIZE];
volatile float g_uart8_neutral_target[RL_SERIAL_V0_TARGET_COUNT];
volatile unsigned int g_uart8_policy_probe_attempt_count;
volatile unsigned int g_uart8_policy_probe_ok_count;
volatile unsigned int g_uart8_policy_probe_policy_ok;
volatile int g_uart8_policy_probe_policy_error;
volatile unsigned int g_uart8_policy_probe_transport_status;
volatile unsigned int g_uart8_policy_probe_protocol_status;
volatile float g_uart8_policy_probe_observation[RL_POLICY_V0_OBSERVATION_DIM];
volatile float g_uart8_policy_probe_action[RL_POLICY_V0_ACTION_DIM];
volatile float g_uart8_policy_probe_target[RL_POLICY_V0_ACTION_DIM];
volatile unsigned int g_uart8_deploy_step_attempt_count;
volatile unsigned int g_uart8_deploy_step_ok_count;
volatile unsigned int g_uart8_deploy_ramp_attempt_count;
volatile unsigned int g_uart8_deploy_ramp_ok_count;
volatile unsigned int g_uart8_deploy_state_ok_count;
volatile unsigned int g_uart8_deploy_policy_ok_count;
volatile unsigned int g_uart8_deploy_neutral_end_ok_count;
volatile unsigned int g_uart8_deploy_abort_reason;
volatile unsigned int g_uart8_deploy_last_step_index;
volatile float g_uart8_deploy_phase;
volatile float g_uart8_deploy_max_abs_roll;
volatile float g_uart8_deploy_max_abs_pitch;
volatile float g_uart8_deploy_max_abs_action;
volatile float g_uart8_deploy_max_abs_delta;
volatile float g_uart8_deploy_last_action[RL_POLICY_V0_ACTION_DIM];
volatile float g_uart8_deploy_last_target[RL_POLICY_V0_ACTION_DIM];

static void capture_last_rl_response(const rl_serial_transport_v0_client_t *client,
                                     const rl_serial_v0_telemetry_state_t *state) {
  size_t frame_len = 0;
  if (client != 0 &&
      rl_serial_v0_expected_frame_len_from_header(client->rx_frame, RL_SERIAL_V0_HEADER_SIZE, &frame_len) ==
          RL_SERIAL_V0_OK &&
      frame_len <= RL_SERIAL_V0_MAX_FRAME_SIZE) {
    g_uart8_rl_last_rx_frame_len = (unsigned int)frame_len;
    for (size_t i = 0; i < frame_len; ++i) {
      g_uart8_rl_last_rx_frame[i] = client->rx_frame[i];
    }
  }
  if (state != 0) {
    g_uart8_rl_last_roll = state->roll;
    g_uart8_rl_last_pitch = state->pitch;
    for (size_t i = 0; i < RL_SERIAL_V0_TARGET_COUNT; ++i) {
      g_uart8_rl_last_joint_feedback[i] = state->joint_feedback[i];
    }
  }
}

static void capture_neutral_set_response(const rl_serial_transport_v0_client_t *client) {
  size_t frame_len = 0;
  g_uart8_neutral_set_rx_frame_len = 0u;
  if (client != 0 &&
      rl_serial_v0_expected_frame_len_from_header(client->rx_frame, RL_SERIAL_V0_HEADER_SIZE, &frame_len) ==
          RL_SERIAL_V0_OK &&
      frame_len <= RL_SERIAL_V0_MAX_FRAME_SIZE) {
    g_uart8_neutral_set_rx_frame_len = (unsigned int)frame_len;
    for (size_t i = 0; i < frame_len; ++i) {
      g_uart8_neutral_set_rx_frame[i] = client->rx_frame[i];
    }
  }
}

static void load_smoke_observation(float observation[RL_POLICY_V0_OBSERVATION_DIM]) {
  static const float kPolicyVectorObservation[RL_POLICY_V0_OBSERVATION_DIM] = {
      0.0f,         0.0f,         0.00119603006f, -0.0015319502f, -0.00222436711f,
      0.20163323f, 1.51129329f,  0.196551949f,   1.2916224f,     0.1985517f,
      1.28960073f, 0.20384492f,  1.5065155f,     0.0f,           0.0f,
      0.0f,         0.0f,         0.0f,           0.0f,           0.0f,
      0.0f,         0.0f,         1.0f,
  };
  for (size_t i = 0; i < RL_POLICY_V0_OBSERVATION_DIM; ++i) {
    observation[i] = kPolicyVectorObservation[i];
    g_smoke_observation[i] = kPolicyVectorObservation[i];
  }
}

static void load_smoke_expected_action(float expected_action[RL_POLICY_V0_ACTION_DIM]) {
  static const float kPolicyVectorAction[RL_POLICY_V0_ACTION_DIM] = {
      0.0845503435f,  0.147667065f,  -0.144941002f, 0.0286343656f,
      -0.1695503f,   -0.387514442f, -0.0495256148f, -0.0660236403f,
  };
  for (size_t i = 0; i < RL_POLICY_V0_ACTION_DIM; ++i) {
    expected_action[i] = kPolicyVectorAction[i];
    g_smoke_expected_action[i] = kPolicyVectorAction[i];
  }
}

static float absf_local(float value) {
  return value < 0.0f ? -value : value;
}

static float clampf_local(float value, float low, float high) {
  if (value < low) {
    return low;
  }
  if (value > high) {
    return high;
  }
  return value;
}

static void capture_action_diff(const float action[RL_POLICY_V0_ACTION_DIM],
                                const float expected_action[RL_POLICY_V0_ACTION_DIM]) {
  float max_abs_diff = 0.0f;
  for (size_t i = 0; i < RL_POLICY_V0_ACTION_DIM; ++i) {
    const float abs_diff = absf_local(action[i] - expected_action[i]);
    g_smoke_action_abs_diff[i] = abs_diff;
    if (abs_diff > max_abs_diff) {
      max_abs_diff = abs_diff;
    }
  }
  g_smoke_action_max_abs_diff = max_abs_diff;
}

