icuic/rl_petoi_stm32/firmware/stm32h747_disco/m7_inference_smoke/main.c
static void smoke_delay_units(unsigned int units) {
  for (unsigned int unit = 0; unit < units; ++unit) {
    for (volatile unsigned int i = 0; i < SMOKE_DELAY_INNER_ITERATIONS; ++i) {
    }
  }
}

#if SMOKE_ENABLE_UART8_TEXT_WARMUP
static void drain_uart8(rl_uart8_transport_v0_t *uart8_transport) {
  uint8_t scratch[64] = {0};
  for (int i = 0; i < 8; ++i) {
    const size_t read_len = rl_uart8_transport_v0_read(scratch,
                                                       sizeof(scratch),
                                                       50u,
                                                       uart8_transport);
    ++g_uart8_drain_round_count;
    g_uart8_drain_rx_bytes += (unsigned int)read_len;
    for (size_t j = 0; j < read_len && j < sizeof(g_uart8_drain_rx); ++j) {
      g_uart8_drain_rx[j] = scratch[j];
    }
    smoke_delay_units(1u);
  }
}

#endif

static void capture_uart8_last_read(const rl_uart8_transport_v0_t *uart8_transport) {
  if (uart8_transport == 0) {
    return;
  }
  g_uart8_last_read_len = uart8_transport->last_read_len;
  for (size_t i = 0u; i < sizeof(g_uart8_last_read); ++i) {
    g_uart8_last_read[i] = uart8_transport->last_read[i];
  }
}

#if SMOKE_ENABLE_UART8_TEXT_WARMUP
static void run_uart8_at_probe(rl_uart8_transport_v0_t *uart8_transport) {
  rl_uart8_transport_v0_command_probe_t probe;
  const int ok = rl_uart8_transport_v0_probe_command(uart8_transport, "AT", &probe, 200u);
  g_uart8_probe_ok = ok ? 1u : 0u;
  g_uart8_probe_tx_len = probe.tx_len;
  g_uart8_probe_rx_len = probe.rx_len;
  g_uart8_probe_timeout_count = uart8_transport->timeout_count;
  g_uart8_probe_overrun_count = uart8_transport->overrun_count;
  for (size_t i = 0u; i < sizeof(g_uart8_probe_rx); ++i) {
    g_uart8_probe_rx[i] = probe.rx[i];
  }

  g_uart8_at_probe_count = 1u;
  g_uart8_at_probe_ok[0] = g_uart8_probe_ok;
  g_uart8_at_probe_command_len[0] = probe.command_len;
  g_uart8_at_probe_tx_len[0] = probe.tx_len;
  g_uart8_at_probe_rx_len[0] = probe.rx_len;
  for (size_t i = 0u; i < sizeof(g_uart8_at_probe_command[0]); ++i) {
    g_uart8_at_probe_command[0][i] = probe.command[i];
  }
  for (size_t i = 0u; i < sizeof(g_uart8_at_probe_rx[0]); ++i) {
    g_uart8_at_probe_rx[0][i] = probe.rx[i];
  }
  capture_uart8_last_read(uart8_transport);
}
#endif

static void load_neutral_target(float target[RL_SERIAL_V0_TARGET_COUNT]) {
  for (size_t i = 0; i < RL_SERIAL_V0_TARGET_COUNT; ++i) {
    target[i] = kPetoiOfficialGaitBaselineV0[0][i];
    g_uart8_neutral_target[i] = kPetoiOfficialGaitBaselineV0[0][i];
  }
}

static int build_deploy_step_from_telemetry(const rl_serial_v0_telemetry_state_t *state,
                                            float phase,
                                            size_t reference_index,
                                            const float previous_action[RL_POLICY_V0_ACTION_DIM],
                                            float observation[RL_POLICY_V0_OBSERVATION_DIM],
                                            float action[RL_POLICY_V0_ACTION_DIM],
                                            float target[RL_POLICY_V0_ACTION_DIM]) {
  static const float kCanonicalJointReference[RL_POLICY_V0_ACTION_DIM] = {
      0.2f, 1.4f, 0.2f, 1.4f, 0.2f, 1.4f, 0.2f, 1.4f,
  };
  static const float kActionScale[RL_POLICY_V0_ACTION_DIM] = {
      0.07f, 0.055f, 0.07f, 0.055f, 0.07f, 0.055f, 0.07f, 0.055f,
  };
  const float *reference =
      kPetoiOfficialGaitBaselineV0[reference_index % PETOI_OFFICIAL_GAIT_BASELINE_V0_FRAME_COUNT];
  if (state == 0 || previous_action == 0 || observation == 0 || action == 0 || target == 0) {
    return 0;
  }

  observation[0] = state->roll;
  observation[1] = state->pitch;
  observation[2] = state->angular_velocity_x;
  observation[3] = state->angular_velocity_y;
  observation[4] = state->angular_velocity_z;
  for (size_t i = 0u; i < RL_POLICY_V0_ACTION_DIM; ++i) {
    observation[5u + i] = kCanonicalJointReference[i];
    observation[13u + i] = previous_action[i];
  }
  observation[21] = sinf(2.0f * SMOKE_PI * phase);
  observation[22] = cosf(2.0f * SMOKE_PI * phase);
  for (size_t i = 0u; i < RL_POLICY_V0_OBSERVATION_DIM; ++i) {
    g_uart8_policy_probe_observation[i] = observation[i];
  }

  const int policy_ok = rl_stedgeai_policy_v0_forward(observation, action, 0);
  g_uart8_policy_probe_policy_ok = policy_ok ? 1u : 0u;
  g_uart8_policy_probe_policy_error = rl_stedgeai_policy_v0_last_error();
  for (size_t i = 0u; i < RL_POLICY_V0_ACTION_DIM; ++i) {
    const float clipped_action = clampf_local(action[i], -1.0f, 1.0f) * SMOKE_DESKTOP_RL_RESIDUAL_SCALE;
    const float raw_target = reference[i] + clipped_action * kActionScale[i];
    const float clipped_target = clampf_local(raw_target, reference[i] - 0.12f, reference[i] + 0.12f);
    const float abs_action = absf_local(clipped_action);
    const float abs_delta = absf_local(clipped_target - reference[i]);
    action[i] = clipped_action;
    target[i] = clipped_target;
    g_uart8_policy_probe_action[i] = clipped_action;
    g_uart8_policy_probe_target[i] = clipped_target;
    g_uart8_deploy_last_action[i] = clipped_action;
    g_uart8_deploy_last_target[i] = clipped_target;
    if (abs_action > g_uart8_deploy_max_abs_action) {
      g_uart8_deploy_max_abs_action = abs_action;
    }
    if (abs_delta > g_uart8_deploy_max_abs_delta) {
      g_uart8_deploy_max_abs_delta = abs_delta;
    }
  }
  return policy_ok;
}

int main(void) {
  float observation[RL_POLICY_V0_OBSERVATION_DIM] = {0};
  float expected_action[RL_POLICY_V0_ACTION_DIM] = {0};
  float action[RL_POLICY_V0_ACTION_DIM] = {0};
  float neutral_target[RL_SERIAL_V0_TARGET_COUNT] = {0};
  rl_uart8_transport_v0_t uart8_transport;
  rl_serial_transport_v0_client_t rl_client;
  rl_serial_v0_telemetry_state_t last_state;
  int have_last_state = 0;
#if SMOKE_ENABLE_UART8_TEXT_WARMUP
  static const uint8_t safe_text_command[] = {'d', '\n'};
#endif

  const rl_uart8_transport_v0_config_t uart8_config = {
      .baud = RL_UART8_V0_DEFAULT_BAUD,
      .clock_hz = SystemCoreClock,
  };
  rl_uart8_transport_v0_init(&uart8_transport, &uart8_config);
  rl_serial_transport_v0_init(&rl_client,
                              rl_uart8_transport_v0_write,
                              rl_uart8_transport_v0_read,
                              &uart8_transport,
                              (uint8_t)'Y',
                              5000u);

  load_smoke_observation(observation);
  load_smoke_expected_action(expected_action);
  g_smoke_policy_ok = rl_stedgeai_policy_v0_forward(observation, action, 0);
  g_smoke_policy_error = rl_stedgeai_policy_v0_last_error();

  for (int i = 0; i < (int)RL_POLICY_V0_ACTION_DIM; ++i) {
    g_smoke_action[i] = action[i];
  }
  capture_action_diff(action, expected_action);

#if SMOKE_DESKTOP_ASCII_UP_WARMUP
  {
    static const uint8_t up_command[] = {'k', 'u', 'p', '\n'};
    for (unsigned int i = 0; i < SMOKE_DESKTOP_UP_COMMAND_COUNT; ++i) {
      const size_t written = rl_uart8_transport_v0_write(up_command,
                                                         sizeof(up_command),
                                                         &uart8_transport);
      if (written == sizeof(up_command)) {
        ++g_uart8_safe_text_tx_count;
        g_uart8_safe_text_tx_bytes += (unsigned int)written;
      }
      smoke_delay_units(SMOKE_DESKTOP_UP_COMMAND_DELAY_UNITS);
    }
    smoke_delay_units(SMOKE_DESKTOP_UP_SETTLE_DELAY_UNITS);
  }
#endif

