icuic/rl_petoi_stm32/firmware/stm32h747_disco/m7_inference_smoke/main.c
#if SMOKE_UART8_TEXT_DIAGNOSTIC
  {
    static const uint8_t up_command[] = {'k', 'u', 'p', '\n'};
    for (int i = 0; i < 8; ++i) {
      const size_t written = rl_uart8_transport_v0_write(up_command,
                                                         sizeof(up_command),
                                                         &uart8_transport);
      if (written == sizeof(up_command)) {
        ++g_uart8_safe_text_tx_count;
        g_uart8_safe_text_tx_bytes += (unsigned int)written;
      }
      smoke_delay_units(5u);
    }
  }
  for (;;) {
  }
#endif

#if SMOKE_UART8_ASCII_QUERY_DIAGNOSTIC
  {
    static const uint8_t query_command[] = {'?', '\n'};
    uint8_t scratch[64] = {0};
    const size_t written = rl_uart8_transport_v0_write(query_command,
                                                       sizeof(query_command),
                                                       &uart8_transport);
    if (written == sizeof(query_command)) {
      ++g_uart8_safe_text_tx_count;
      g_uart8_safe_text_tx_bytes += (unsigned int)written;
    }
    smoke_delay_units(8u);
    for (int i = 0; i < 16; ++i) {
      const size_t read_len = rl_uart8_transport_v0_read(scratch,
                                                         sizeof(scratch),
                                                         250u,
                                                         &uart8_transport);
      ++g_uart8_drain_round_count;
      g_uart8_drain_rx_bytes += (unsigned int)read_len;
      for (size_t j = 0; j < read_len && j < sizeof(g_uart8_drain_rx); ++j) {
        g_uart8_drain_rx[j] = scratch[j];
      }
      capture_uart8_last_read(&uart8_transport);
      smoke_delay_units(2u);
    }
  }
  for (;;) {
  }
#endif

#if SMOKE_ENABLE_UART8_TEXT_WARMUP
  run_uart8_at_probe(&uart8_transport);
  smoke_delay_units(24u);
  for (int i = 0; i < 4; ++i) {
    const size_t written = rl_uart8_transport_v0_write(safe_text_command,
                                                       sizeof(safe_text_command),
                                                       &uart8_transport);
    if (written == sizeof(safe_text_command)) {
      ++g_uart8_safe_text_tx_count;
      g_uart8_safe_text_tx_bytes += (unsigned int)written;
    }
    smoke_delay_units(30u);
  }
  drain_uart8(&uart8_transport);
#endif

  for (size_t i = 0; i < SMOKE_RL_GET_STATE_ATTEMPTS; ++i) {
    uint16_t status = 0;
    rl_serial_v0_telemetry_state_t state;
    ++g_uart8_rl_get_state_attempt_count;
    const rl_serial_transport_v0_status_t transport_status =
        rl_serial_transport_v0_get_state(&rl_client, &status, &state);
    g_uart8_rl_last_transport_status = (unsigned int)transport_status;
    g_uart8_rl_last_protocol_status = status;
    g_uart8_rl_transport_rx_bytes = uart8_transport.rx_bytes;
    g_uart8_rl_transport_timeout_count = uart8_transport.timeout_count;
    g_uart8_rl_transport_overrun_count = uart8_transport.overrun_count;
    g_uart8_rl_attempt_transport_status[i] = (unsigned int)transport_status;
    g_uart8_rl_attempt_protocol_status[i] = status;
    g_uart8_rl_attempt_rx_bytes[i] = uart8_transport.rx_bytes;
    g_uart8_rl_attempt_timeout_count[i] = uart8_transport.timeout_count;
    g_uart8_rl_attempt_overrun_count[i] = uart8_transport.overrun_count;
    capture_uart8_last_read(&uart8_transport);
    if (transport_status == RL_TRANSPORT_V0_OK &&
        (status & RL_SERIAL_V0_STATUS_TELEMETRY_VALID) != 0u) {
      ++g_uart8_rl_get_state_ok_count;
      last_state = state;
      have_last_state = 1;
      capture_last_rl_response(&rl_client, &state);
      break;
    }
    smoke_delay_units(20u);
  }

  if (have_last_state) {
    uint16_t set_status = 0u;
    load_neutral_target(neutral_target);
    ++g_uart8_neutral_set_attempt_count;
    const rl_serial_transport_v0_status_t set_transport_status =
        rl_serial_transport_v0_set_targets(&rl_client, neutral_target, &set_status);
    g_uart8_neutral_set_transport_status = (unsigned int)set_transport_status;
    g_uart8_neutral_set_protocol_status = set_status;
    g_uart8_rl_transport_rx_bytes = uart8_transport.rx_bytes;
    g_uart8_rl_transport_timeout_count = uart8_transport.timeout_count;
    g_uart8_rl_transport_overrun_count = uart8_transport.overrun_count;
    capture_neutral_set_response(&rl_client);
    capture_uart8_last_read(&uart8_transport);
    if (set_transport_status == RL_TRANSPORT_V0_OK &&
        (set_status & RL_SERIAL_V0_STATUS_COMMAND_ACCEPTED) != 0u) {
      ++g_uart8_neutral_set_ok_count;
    }
  }

  if (g_uart8_neutral_set_ok_count == 1u && have_last_state) {
    float policy_previous_action[RL_POLICY_V0_ACTION_DIM] = {0};
    float policy_observation[RL_POLICY_V0_OBSERVATION_DIM] = {0};
    float policy_action[RL_POLICY_V0_ACTION_DIM] = {0};
    float policy_target[RL_POLICY_V0_ACTION_DIM] = {0};

    for (size_t ramp_step = 0u; ramp_step < SMOKE_DEPLOY_RAMP_STEPS; ++ramp_step) {
      float ramp_target[RL_POLICY_V0_ACTION_DIM] = {0};
      uint16_t ramp_status = 0u;
      const float alpha = (float)(ramp_step + 1u) / (float)SMOKE_DEPLOY_RAMP_STEPS;
      ++g_uart8_deploy_ramp_attempt_count;
      for (size_t i = 0u; i < RL_POLICY_V0_ACTION_DIM; ++i) {
        ramp_target[i] = neutral_target[i] + (kPetoiOfficialGaitBaselineV0[0][i] - neutral_target[i]) * alpha;
      }
      const rl_serial_transport_v0_status_t ramp_transport_status =
          rl_serial_transport_v0_set_targets(&rl_client, ramp_target, &ramp_status);
      g_uart8_rl_transport_rx_bytes = uart8_transport.rx_bytes;
      g_uart8_rl_transport_timeout_count = uart8_transport.timeout_count;
      g_uart8_rl_transport_overrun_count = uart8_transport.overrun_count;
      capture_uart8_last_read(&uart8_transport);
      if (ramp_transport_status != RL_TRANSPORT_V0_OK ||
          (ramp_status & RL_SERIAL_V0_STATUS_COMMAND_ACCEPTED) == 0u) {
        g_uart8_deploy_abort_reason = 5u;
        break;
      }
      ++g_uart8_deploy_ramp_ok_count;
      smoke_delay_units(1u);
    }

