icuic/rl_petoi_stm32/firmware/stm32h747_disco/m7_inference_smoke/main.c
    for (size_t step = 0u; step < SMOKE_DEPLOY_STEP_COUNT; ++step) {
      uint16_t state_status = 0u;
      uint16_t policy_set_status = 0u;
      rl_serial_v0_telemetry_state_t state;
      const size_t reference_index = step * SMOKE_DEPLOY_GAIT_FRAME_STRIDE;
      const float phase =
          (float)(reference_index % PETOI_OFFICIAL_GAIT_BASELINE_V0_FRAME_COUNT) /
          (float)PETOI_OFFICIAL_GAIT_BASELINE_V0_FRAME_COUNT;
      if (g_uart8_deploy_abort_reason != 0u) {
        break;
      }
      ++g_uart8_deploy_step_attempt_count;
      g_uart8_deploy_last_step_index = (unsigned int)step;
      g_uart8_deploy_phase = phase;

      if ((step % SMOKE_DEPLOY_STATE_REFRESH_INTERVAL) == 0u) {
        const rl_serial_transport_v0_status_t state_transport_status =
            rl_serial_transport_v0_get_state(&rl_client, &state_status, &state);
        g_uart8_rl_last_transport_status = (unsigned int)state_transport_status;
        g_uart8_rl_last_protocol_status = state_status;
        g_uart8_rl_transport_rx_bytes = uart8_transport.rx_bytes;
        g_uart8_rl_transport_timeout_count = uart8_transport.timeout_count;
        g_uart8_rl_transport_overrun_count = uart8_transport.overrun_count;
        capture_uart8_last_read(&uart8_transport);
        if (state_transport_status != RL_TRANSPORT_V0_OK ||
            (state_status & RL_SERIAL_V0_STATUS_TELEMETRY_VALID) == 0u) {
          g_uart8_deploy_abort_reason = 1u;
          break;
        }
        last_state = state;
        capture_last_rl_response(&rl_client, &state);
      } else {
        state = last_state;
      }
      ++g_uart8_deploy_state_ok_count;

      const float abs_roll = absf_local(state.roll);
      const float abs_pitch = absf_local(state.pitch);
      if (abs_roll > g_uart8_deploy_max_abs_roll) {
        g_uart8_deploy_max_abs_roll = abs_roll;
      }
      if (abs_pitch > g_uart8_deploy_max_abs_pitch) {
        g_uart8_deploy_max_abs_pitch = abs_pitch;
      }
      if (step >= SMOKE_DESKTOP_SAFETY_GRACE_STEPS &&
          (abs_roll > SMOKE_DESKTOP_DEPLOY_ATTITUDE_LIMIT ||
           abs_pitch > SMOKE_DESKTOP_DEPLOY_ATTITUDE_LIMIT)) {
        g_uart8_deploy_abort_reason = 2u;
        break;
      }

      ++g_uart8_policy_probe_attempt_count;
      if (!build_deploy_step_from_telemetry(&last_state,
                                            phase,
                                            reference_index,
                                            policy_previous_action,
                                            policy_observation,
                                            policy_action,
                                            policy_target)) {
        g_uart8_deploy_abort_reason = 3u;
        break;
      }
      ++g_uart8_policy_probe_ok_count;
      ++g_uart8_deploy_policy_ok_count;

      const rl_serial_transport_v0_status_t policy_set_transport_status =
          rl_serial_transport_v0_set_targets(&rl_client, policy_target, &policy_set_status);
      g_uart8_policy_probe_transport_status = (unsigned int)policy_set_transport_status;
      g_uart8_policy_probe_protocol_status = policy_set_status;
      g_uart8_rl_transport_rx_bytes = uart8_transport.rx_bytes;
      g_uart8_rl_transport_timeout_count = uart8_transport.timeout_count;
      g_uart8_rl_transport_overrun_count = uart8_transport.overrun_count;
      capture_uart8_last_read(&uart8_transport);
      if (policy_set_transport_status != RL_TRANSPORT_V0_OK ||
          (policy_set_status & RL_SERIAL_V0_STATUS_COMMAND_ACCEPTED) == 0u) {
        g_uart8_deploy_abort_reason = 4u;
        break;
      }
      ++g_uart8_deploy_step_ok_count;
      for (size_t i = 0u; i < RL_POLICY_V0_ACTION_DIM; ++i) {
        policy_previous_action[i] = policy_action[i];
      }
      smoke_delay_units(1u);
    }

    {
      uint16_t neutral_end_status = 0u;
      const rl_serial_transport_v0_status_t neutral_end_transport_status =
          rl_serial_transport_v0_set_targets(&rl_client, neutral_target, &neutral_end_status);
      g_uart8_rl_transport_rx_bytes = uart8_transport.rx_bytes;
      g_uart8_rl_transport_timeout_count = uart8_transport.timeout_count;
      g_uart8_rl_transport_overrun_count = uart8_transport.overrun_count;
      capture_uart8_last_read(&uart8_transport);
      if (neutral_end_transport_status == RL_TRANSPORT_V0_OK &&
          (neutral_end_status & RL_SERIAL_V0_STATUS_COMMAND_ACCEPTED) != 0u) {
        ++g_uart8_deploy_neutral_end_ok_count;
      }
    }
  }

  for (;;) {
  }
}
